Config/Enums/ВидыОперацийИсходящееИзвещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИсходящееИзвещение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаНФАСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНФАПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаБСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаТребований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаОбязательств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФинансовыхВложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВложенийВФинансовыеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаРБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеДохода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНФАПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеНФАСоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеТребований</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеОбязательств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеДохода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеФинансовыхВложений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеВложенийВФинансовыеАктивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоМБТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРасчетовПоМБТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеРБП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаРасчетовПоПоставкамНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаУточненияРасчетовПоПоставкамНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПодтвержденияРасчетовПоПоставкамНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПодтвержденияУточненияРасчетовПоПоставкамНФА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПолучателя_ПолучениеГрузополучателемНФАОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПолучателя_ПодтверждениеПолученияГрузополучателемНФАОтПоставщикаРезервЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПолучателя_ПодтверждениеПолученияГрузополучателемНФАОтПоставщикаЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПолучателя_ПередачаСведенийОРазделенииЗемельныхУчастковОПУИ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтПолучателя_ОтражениеВУчетеРазделенияЗемельныхУчастковЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОперацийИсходящееИзвещение/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Относится ли ВидИзвещения к документообороту извещениями, который начинается
// на строне получателя.
// 
// Параметры:
//  ВидИзвещения - ПеречислениеСсылка.ВидыОперацийИсходящееИзвещение
// 
// Возвращаемое значение:
//  Булево
Функция ДокументооборотСоСтороныПолучателя(ВидИзвещения) Экспорт
	ВидыОпераций = ЦентрализованноеСнабжениеПовтИсп.КлассификацияВидовОпераций(ПустаяСсылка());
	СтрокаВидаИзвещения = ВидыОпераций.Найти(ВидИзвещения, "ВидИзвещения");
	Если СтрокаВидаИзвещения <> Неопределено Тогда
		Возврат СтрокаВидаИзвещения.СоСтороныПолучателя;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции

// Виды ответных операций.
// 
// Возвращаемое значение:
//  Соответствие - Виды ответных операций
Функция ВидыОтветныхОпераций() Экспорт
	Возврат ЦентрализованноеСнабжение.ВидыОтветныхОперацийИсходящееИзвещение();
КонецФункции

// Классификация видов операций.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Классификация видов операций:
// * ВидИзвещения - ПеречислениеСсылка.ВидыОперацийИсходящееИзвещение - 
// * Классический - Булево - 
// * ЭДО - Булево - 
// * СоСтороныОтправителя - Булево - 
// * СоСтороныПолучателя - Булево - 
Функция КлассификацияВидовОпераций() Экспорт
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ВидИзвещения", Новый ОписаниеТипов("ПеречислениеСсылка.ВидыОперацийИсходящееИзвещение"));
	Результат.Колонки.Добавить("Классический", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("ЭДО", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СоСтороныОтправителя", Новый ОписаниеТипов("Булево"));
	Результат.Колонки.Добавить("СоСтороныПолучателя", Новый ОписаниеТипов("Булево"));
	
	ДобавитьВТЗ(Результат, "ПередачаНФАСоСклада",															Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаНФАПоставщика",															Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаБСО",																	Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаДенежныхСредств",														Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаТребований",															Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаОбязательств",															Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаФинансовыхВложений",													Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаВложенийВФинансовыеАктивы",												Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаРБП",																	Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "НачислениеДохода",																Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеНФАПоставщика",														Ложь,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеНФАСоСклада",															Ложь,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеБСО",																	Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеДенежныхСредств",														Ложь,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеТребований",															Ложь,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеОбязательств",															Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеДохода",																Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеФинансовыхВложений",													Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеВложенийВФинансовыеАктивы",											Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "РасчетыПоМБТ",																	Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеРасчетовПоМБТ",														Ложь,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПолучениеРБП",																	Истина,	Истина,	Истина,	Ложь);
	ДобавитьВТЗ(Результат, "ПередачаРасчетовПоПоставкамНФА",												Истина,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ПередачаУточненияРасчетовПоПоставкамНФА",										Истина,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ПередачаПодтвержденияРасчетовПоПоставкамНФА",									Ложь,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ПередачаПодтвержденияУточненияРасчетовПоПоставкамНФА",							Ложь,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ОтПолучателя_ПолучениеГрузополучателемНФАОтПоставщика",							Истина,	Ложь,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ОтПолучателя_ПодтверждениеПолученияГрузополучателемНФАОтПоставщикаРезервЭДО",	Ложь,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ОтПолучателя_ПодтверждениеПолученияГрузополучателемНФАОтПоставщикаЭДО",			Ложь,	Истина,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ОтПолучателя_ПередачаСведенийОРазделенииЗемельныхУчастковОПУИ",					Истина,	Ложь,	Ложь,	Истина);
	ДобавитьВТЗ(Результат, "ОтПолучателя_ОтражениеВУчетеРазделенияЗемельныхУчастковЭДО",					Ложь,	Истина,	Ложь,	Истина);
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбораОтветные = Новый СписокЗначений;
	ДанныеВыбораОтПолучателя = Новый СписокЗначений;
	ОтветныеВиды = ЦентрализованноеСнабжение.ВидыОтветныхОперацийИсходящееИзвещение();
	СтрокаПоиска = Параметры.СтрокаПоиска;
	ЗаданаСтрокаПоиска = ЗначениеЗаполнено(СтрокаПоиска);
	ШаблонИзвещенияОтПолучателя = НСтр("ru = '%1 (извещение от получателя)'");
	ШаблонОтветногоИзвещения = НСтр("ru = '%1 (ответная операция ЭДО)'");
	Для Каждого ЗначениеПеречисления Из Перечисления.ВидыОперацийИсходящееИзвещение Цикл
		Наименование = Строка(ЗначениеПеречисления);
		Если ЗаданаСтрокаПоиска И НЕ СтрНачинаетсяС(Наименование, СтрокаПоиска) Тогда
			Продолжить;
		КонецЕсли;
		Если ОтветныеВиды.Получить(ЗначениеПеречисления) <> Неопределено Тогда
			Наименование = СтрШаблон(ШаблонОтветногоИзвещения, Наименование);
			ДанныеВыбораОтветные.Добавить(ЗначениеПеречисления, Наименование);
		ИначеЕсли ДокументооборотСоСтороныПолучателя(ЗначениеПеречисления) Тогда
			ДанныеВыбораОтПолучателя.Добавить(ЗначениеПеречисления,
				СтрШаблон(ШаблонИзвещенияОтПолучателя, Наименование));
		Иначе
			ДанныеВыбора.Добавить(ЗначениеПеречисления, Наименование);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ВидОтПолучателя Из ДанныеВыбораОтПолучателя Цикл
		ДанныеВыбора.Добавить(ВидОтПолучателя.Значение, ВидОтПолучателя.Представление);
	КонецЦикла;
	Для Каждого ОтветныйВид Из ДанныеВыбораОтветные Цикл
		ДанныеВыбора.Добавить(ОтветныйВид.Значение, ОтветныйВид.Представление);
	КонецЦикла;
	Если ДанныеВыбора.Количество() > 0 Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьВТЗ(Классификатор, Имя, Классический, ЭДО, СоСтороныОтправителя, СоСтороныПолучателя)
	НоваяСтрока = Классификатор.Добавить();
	НоваяСтрока.ВидИзвещения = Перечисления.ВидыОперацийИсходящееИзвещение[Имя];
	НоваяСтрока.Классический = Классический;
	НоваяСтрока.ЭДО = ЭДО;
	НоваяСтрока.СоСтороныОтправителя = СоСтороныОтправителя;
	НоваяСтрока.СоСтороныПолучателя = СоСтороныПолучателя;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
